{
  "id": "manual-1769884845154",
  "url": "https://drbi.org",
  "lastModified": "2026-01-31T18:45:15.256Z",
  "name": "The Bahá'í Fireside: A Sacred Tradition",
  "shortDescription": "Traditional Bahá'í Fireside at Desert Rose Bahá'í Institute's Roundhouse, following the intimate teaching method originated by the Báb circa 1845. A warm, natural introduction to the Bahá'í Faith for seekers through scripture and discussion. Facilitator: Professor William Maxwell, Ed.D. First Tuesday monthly, 7:00 p.m. MST. All seekers welcome.",
  "startDate": "2026-02-07T19:00",
  "endDate": "2026-02-07T20:00",
  "image": "/images/event-placeholder.jpg",
  "teacherImage": "https://drbi.s3.amazonaws.com/events/manual-1769884845154-teacher-1769885100869.jpg",
  "fullDescription": "**The Bahá'í Fireside: A Sacred Tradition**\r\n\r\nThe Fireside concept, invented by the Báb circa 1845, offers seekers a natural, intimate introduction to the Bahá'í Faith. Held in the welcoming atmosphere of Desert Rose Bahá'í Institute's Roundhouse, these monthly gatherings follow the original pattern: one speaker quotes from Scripture and briefly explains its implications while seekers are encouraged to ask questions.\r\n\r\n**The Fireside Method:**\r\nHand of the Cause Mr. Faizi explained at Oxford in 1963 that the essence of Fireside teaching is patient listening: \"Let the speaker (partly) empty his cup before you try to fill it with new ideas.\" This is not a deepening class but an introduction where seekers must feel the true warmth of Divine Love. The hoped-for outcome is that seekers will request further study, demonstrating genuine eagerness to learn more.\r\n\r\n**A Living Tradition:**\r\nBahá'u'lláh laid the foundation by requiring every Bahá'í to open their home monthly to relatives, neighbors, friends, and co-workers. 'Abdu'l-Bahá and Shoghi Effendi endorsed the Fireside concept in dozens of Tablets and letters. This sacred practice continues at Desert Rose in perpetuity, helping every Bahá'í—including children and youth—feel competent to express true love for their neighbors as commanded by Christ (John 13:34).",
  "highlights": [],
  "location": {
    "name": "Online",
    "address": "",
    "city": "",
    "state": "",
    "zip": ""
  },
  "price": null,
  "registrationUrl": "https://drbi.org",
  "organizer": "DRBI",
  "categories": [],
  "source": "manual",
  "visible": true,
  "scraped": {
    "orgPageDate": "2026-01-31T18:40:45.155Z",
    "detailPageDate": "2026-01-31T18:40:45.155Z"
  },
  "title": "The Bahá'í Fireside: A Sacred Tradition",
  "featured": false,
  "onsite": false,
  "mainImage": "https://drbi.s3.amazonaws.com/events/manual-1769884845154-main-1769884927108.webp",
  "isEventbrite": false,
  "eventbriteId": null,
  "manuallyEdited": true,
  "lastManualEdit": "2026-01-31T18:45:15.250Z"
}